{"name": "Nooelec Satellite Mesh Antenna Bundle for Inmarsat, Iridium, & Hydrogen Line Applications. 20dBi Parabolic Antenna w/ 1.4GHz Center Frequency, 300MHz+ Bandwidth. LMR400 SMA Feed Cable & Mounting Kit", "price": "$137.95", "short_description": "About this item A reliable and high-quality mesh antenna set optimized to receive many L-band signals such as Inmarsat, Iridium, and Hydrogen Line (hydrogen's natural frequency) Our 20dBi antenna is perfect for L-band applications where the antenna is stationary. With a center frequency of 1.4GHz and a bandwidth greater than 300MHz, it encompasses many popular satellite applications Lightweight and durable design with high gain and low noise performance, ideal for outdoor applications such as satellite communication, remote sensing, and weather tracking The antenna is equipped with a sub-reflector for enhanced performance and features an SMA termination for easy connectivity to existing radio equipment The antenna is easy to assemble, and comes with an arm and coaxial cable attached to the arm for easy installation. Also included in the package is a versatile mounting kit that can be employed to cater to various installation situations", "images": "{\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SY450_.jpg\":[450,450],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SX569_.jpg\":[569,569],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SY355_.jpg\":[355,355],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SX466_.jpg\":[466,466],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SX425_.jpg\":[425,425],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SX522_.jpg\":[522,522],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SX679_.jpg\":[679,679]}", "rating": "5.0 out of 5 stars", "number_of_reviews": "1 rating", "asin_value": "B0C4CGKYBV", "variants": null, "product_description": "Are you looking for a reliable antenna bundle to enhance your L-Band applications? Look no further! Our high-performance L-Band parabolic antenna is here and delivers outstanding performance. With a gain of approximately 20dBi, this antenna ensures optimal signal reception for L-Band applications such as Inmarsat, Iridium, and Hydrogen Line Applications. The antenna comes equipped with an LMR400 cable terminated with male SMA connectors, making it easy to connect to your radio system. Measuring 0.99m x 0.61m x 0.38m (39\" x 24\" x 15\") when assembled, this antenna strikes the ideal balance between size and performance. Weighing approximately 2kg (70.5oz), it is lightweight and easy to install. Whether using it for professional or personal applications, this antenna is designed to meet your needs. Full 2-year warranty directly through Nooelec!"}
{"name": "Nooelec GOES Weather Satellite Mesh Antenna - 21dBi Parabolic Antenna w/ 1.7GHz Center Frequency, 200MHz+ Bandwidth, LMR400 Feed Cable with Male SMA Connector, Mounting Hardware, & 2 Year Warranty", "price": "$137.95", "short_description": "About this item This 21dBi antenna is meant for high gain L-band applications where the antenna is stationary. The center frequency is 1.75GHz, and bandwidth is 200MHz or greater. This encompasses many popular weather satellite applications and constellations Can be deployed for both linearly and circularly polarized signals (RHCP and LHCP) Software is required for the decoding of images. The recommended option is SatDump, which is cross-platform and available for Windows, Linux, MacOS and Android. There are also other free Linux-based decoders, or the paid version of XRIT Decoder for Windows (license not included with purchase) Full 2 year warranty directly through Nooelec! Additional information and assembly instructions: support.nooelec.com/hc/en-us/articles/360058812593", "images": "{\"https://m.media-amazon.com/images/I/71jx6RGX8OL._AC_SX679_.jpg\":[679,679],\"https://m.media-amazon.com/images/I/71jx6RGX8OL._AC_SY355_.jpg\":[355,355],\"https://m.media-amazon.com/images/I/71jx6RGX8OL._AC_SX522_.jpg\":[522,522],\"https://m.media-amazon.com/images/I/71jx6RGX8OL._AC_SY450_.jpg\":[450,450],\"https://m.media-amazon.com/images/I/71jx6RGX8OL._AC_SX569_.jpg\":[569,569],\"https://m.media-amazon.com/images/I/71jx6RGX8OL._AC_SX425_.jpg\":[425,425],\"https://m.media-amazon.com/images/I/71jx6RGX8OL._AC_SX466_.jpg\":[466,466]}", "rating": "4.3 out of 5 stars", "number_of_reviews": "19 ratings", "asin_value": "B08NLDTDM7", "variants": null, "product_description": "The included antenna is a high-performance L-Band GOES weather satellite parabolic antenna. It has a gain of ~21dBi and an LMR400 cable terminated with male SMA connectors to connect to your gear. The antenna is linearly polarized (vertical or horizontal depending on the mounting), with an electric field aligned with the main reflector and feed-point grid lines. It can be deployed for both linearly and circularly polarized signals (RHCP and LHCP). Assembled antenna dimensions are 0.99m x 0.61m x 0.38m (39\" x 24\" x 15\"). It weighs about 2kg (70.5oz). Our GOES antenna performs highly effectively when paired with the SAWbird+ GOES LNA module (NOT included) This antenna receives GOES broadcasts with ease due to its fairly confined radiation pattern, without the necessity of highly accurate pointing at the target satellite, as it features a 3dB beam width of 15deg (+/- 7.5deg) on the axis parallel to the main reflector and feed-point grid lines, and 10deg (+/- 5deg) on the orthogonal axis. It is recommended to mount the antenna on a pole of not more than 5cm (2\") in diameter, and would perform equally well when mounted vertically or horizontally. Full 2 year warranty directly through Nooelec! Additional information and assembly instructions: support.nooelec.com/hc/en-us/articles/360058812593"}
