{"name": "Nooelec Satellite Mesh Antenna Bundle for Inmarsat, Iridium, & Hydrogen Line Applications. 20dBi Parabolic Antenna w/ 1.4GHz Center Frequency, 300MHz+ Bandwidth. LMR400 SMA Feed Cable & Mounting Kit", "price": "$137.95", "short_description": "About this item A reliable and high-quality mesh antenna set optimized to receive many L-band signals such as Inmarsat, Iridium, and Hydrogen Line (hydrogen's natural frequency) Our 20dBi antenna is perfect for L-band applications where the antenna is stationary. With a center frequency of 1.4GHz and a bandwidth greater than 300MHz, it encompasses many popular satellite applications Lightweight and durable design with high gain and low noise performance, ideal for outdoor applications such as satellite communication, remote sensing, and weather tracking The antenna is equipped with a sub-reflector for enhanced performance and features an SMA termination for easy connectivity to existing radio equipment The antenna is easy to assemble, and comes with an arm and coaxial cable attached to the arm for easy installation. Also included in the package is a versatile mounting kit that can be employed to cater to various installation situations", "images": "{\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SY450_.jpg\":[450,450],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SX569_.jpg\":[569,569],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SY355_.jpg\":[355,355],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SX466_.jpg\":[466,466],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SX425_.jpg\":[425,425],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SX522_.jpg\":[522,522],\"https://m.media-amazon.com/images/I/710F1-RxM-L._AC_SX679_.jpg\":[679,679]}", "rating": "5.0 out of 5 stars", "number_of_reviews": null, "variants": null, "product_description": "Are you looking for a reliable antenna bundle to enhance your L-Band applications? Look no further! Our high-performance L-Band parabolic antenna is here and delivers outstanding performance. With a gain of approximately 20dBi, this antenna ensures optimal signal reception for L-Band applications such as Inmarsat, Iridium, and Hydrogen Line Applications. The antenna comes equipped with an LMR400 cable terminated with male SMA connectors, making it easy to connect to your radio system. Measuring 0.99m x 0.61m x 0.38m (39\" x 24\" x 15\") when assembled, this antenna strikes the ideal balance between size and performance. Weighing approximately 2kg (70.5oz), it is lightweight and easy to install. Whether using it for professional or personal applications, this antenna is designed to meet your needs. Full 2-year warranty directly through Nooelec!", "sales_rank": null, "link_to_all_reviews": null}
